Project3/app/Http/Controllers/AdminController.php

select * from `courses` order by `approved` asc limit 10 offset 30
select count(*) as aggregate from `courses`
---
    public function index()
    {
        $courses = \DB::table('courses')->orderBy('approved', 'asc')->paginate(10);

update `courses` set `approved` = 1, `courses`.`updated_at` = '2020-07-06 16:56:04' where `id` = 57
---
    public function approve($id)
    {
        $course           = Course::find($id);
        $course->approved = 1;
        $course->save();