Project3/app/Http/Controllers/CoursesController.php

    public function index($technology_name)
    {
        $languages     = Language::all();
        $subcategories = Subcategory::all();
        $technologies  = Technology::with('courses.subcategories', 'courses.languages', 'courses.votes')
            ->where('technology_name', $technology_name)
            ->first();
        $courses       = Course::with('subcategories')->filterBy(request()->all())->get();
---
select * from `languages`
select * from `subcategories`
select * from `technologies` where `technology_name` = 'Laravel' limit 1
select `courses`.*, `course_technology`.`technology_id` as `pivot_technology_id`, `course_technology`.`course_id` as `pivot_course_id`, `course_technology`.`created_at` as `pivot_created_at`, `course_technology`.`updated_at` as `pivot_updated_at` from `courses` inner join `course_technology` on `courses`.`id` = `course_technology`.`course_id` where `course_technology`.`technology_id` in (2)
select `languages`.*, `course_languages`.`course_id` as `pivot_course_id`, `course_languages`.`language_id` as `pivot_language_id` from `languages` inner join `course_languages` on `languages`.`id` = `course_languages`.`language_id` where `course_languages`.`course_id` in (2, 3, 5, 11, 27, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57)
select `subcategories`.*, `course_subcategory`.`course_id` as `pivot_course_id`, `course_subcategory`.`subcategory_id` as `pivot_subcategory_id`, `course_subcategory`.`created_at` as `pivot_created_at`, `course_subcategory`.`updated_at` as `pivot_updated_at` from `subcategories` inner join `course_subcategory` on `subcategories`.`id` = `course_subcategory`.`subcategory_id` where `course_subcategory`.`course_id` in (2, 3, 5, 11, 27, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57)
select * from `courses`
select `subcategories`.*, `course_subcategory`.`course_id` as `pivot_course_id`, `course_subcategory`.`subcategory_id` as `pivot_subcategory_id`, `course_subcategory`.`created_at` as `pivot_created_at`, `course_subcategory`.`updated_at` as `pivot_updated_at` from `subcategories` inner join `course_subcategory` on `subcategories`.`id` = `course_subcategory`.`subcategory_id` where `course_subcategory`.`course_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57)

    public function store()
    {
        $this->validateCourse();
        $course          = new Course(request(['name', 'type', 'medium', 'level', 'url']));
        $course->user_id = auth()->user()->id;
        $course->save();
---
insert into `courses` (`name`, `type`, `medium`, `level`, `url`, `user_id`, `updated_at`, `created_at`) values ('Quentin Valenzuela', 'paid', 'video', 'advanced', 'https://laracasts.com/series/laravel-6-from-scratch', 8, '2020-07-06 16:55:09', '2020-07-06 16:55:09')