Project3/app/Http/Controllers/TechnologyController.php

select * from `languages`
select * from `subcategories`
select * from `categories` where `categories`.`id` in (1)
select * from `technologies` where `category_id` = 1
---
    public function programming()
    {
        $languages     = Language::all();
        $subcategories = Subcategory::all();
        $programming   = Technology::with('categories')->where('category_id', 1)->get();

select * from `languages`
select * from `subcategories`
select * from `categories` where `categories`.`id` in (2)
select * from `technologies` where `category_id` = 2
---
    public function dataScience()
    {
        $languages     = Language::all();
        $subcategories = Subcategory::all();
        $data_science  = Technology::with('categories')->where('category_id', 2)->get();

select * from `languages`
select * from `subcategories`
select * from `categories` where `categories`.`id` in (3)
select * from `technologies` where `category_id` = 3
---
    public function devOps()
    {
        $languages     = Language::all();
        $subcategories = Subcategory::all();
        $devOps        = Technology::with('categories')->where('category_id', 3)->get();

select * from `languages`
select * from `subcategories`
select * from `categories` where `categories`.`id` in (4)
select * from `technologies` where `category_id` = 4
---
    public function design()
    {
        $languages     = Language::all();
        $subcategories = Subcategory::all();
        $design        = Technology::with('categories')->where('category_id', 4)->get();

select * from `technologies` where `technology_name` like '%J%'
---
    public function search(Request $request)
    {

        $input = $request->all();
        $query = $input['query'];

        $technologies = Technology::where('technology_name', 'like', "%$query%")
            ->get()
            ->toArray();