Project3/routes/web.php

});

Route::get('filtered', function () {
    return Course::with('subcategories', 'users')->withCount('votes')->filterBy(request()->all())->get();
---
select * from `courses` where `type` = 'free'
select * from `users` where `users`.`id` in (2, 5, 6, 7, 8, 11, 16, 18, 21, 22, 26, 27, 29, 33, 35, 37, 38, 39, 41, 43, 45, 46, 50, 51)
select `subcategories`.*, `course_subcategory`.`course_id` as `pivot_course_id`, `course_subcategory`.`subcategory_id` as `pivot_subcategory_id`, `course_subcategory`.`created_at` as `pivot_created_at`, `course_subcategory`.`updated_at` as `pivot_updated_at` from `subcategories` inner join `course_subcategory` on `subcategories`.`id` = `course_subcategory`.`subcategory_id` where `course_subcategory`.`course_id` in (1, 4, 5, 6, 7, 12, 14, 17, 18, 22, 23, 25, 27, 29, 31, 33, 34, 35, 37, 39, 41, 42, 46, 47, 48, 49, 50, 54, 56)